RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sf_ctrl.c
    if (BL_IS_REG_BIT_SET(tmpVal, SF_CTRL_SF_AES_EN)) {
        return SET;
    }

    return RESET;
}
#endif

/****************************************************************************/ /**
 * @brief  Set flash image offset
 *
 * @param  addrOffset: Address offset value
 * @param  group: CPU group id 0 or 1
 * @param  bank: Flash bank select
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_Set_Flash_Image_Offset(uint32_t addrOffset, uint8_t group, SF_Ctrl_Bank_Select bank)
{
    /* Check the parameters */
    CHECK_PARAM(IS_SF_CTRL_BANK_SELECT(bank));

    if (group) {
        if (bank == SF_CTRL_FLASH_BANK0) {
            BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_ID1_OFFSET, addrOffset);
        } else {
            BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_BK2_ID1_OFFSET, addrOffset);
        }
    } else {
        if (bank == SF_CTRL_FLASH_BANK0) {
            BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_ID0_OFFSET, addrOffset);
        } else {
            BL_WR_REG(SF_CTRL_BASE, SF_CTRL_SF_BK2_ID0_OFFSET, addrOffset);
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  Get flash image offset
 *
 * @param  group: CPU group id 0 or 1
 * @param  bank: Flash bank select
 *
 * @return :Address offset value
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
uint32_t ATTR_TCM_SECTION SF_Ctrl_Get_Flash_Image_Offset(uint8_t group, SF_Ctrl_Bank_Select bank)
{
    uint32_t tmpVal = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_SF_CTRL_BANK_SELECT(bank));

    if (group) {
        if (bank == SF_CTRL_FLASH_BANK0) {
            tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_ID1_OFFSET);
        } else {
            tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_BK2_ID1_OFFSET);
        }
    } else {
        if (bank == SF_CTRL_FLASH_BANK0) {
            tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_ID0_OFFSET);
        } else {
            tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_SF_BK2_ID0_OFFSET);
        }
    }

    return tmpVal;
}
#endif

/****************************************************************************/ /**
 * @brief  Lock/unlock sf_id0/sf_id1/sf_bk2_id0/sf_bk2_id1 offset
 *
 * @param  lock: lock or unlock
 *
 * @return :None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_Lock_Flash_Image_Offset(uint8_t lock)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_2);
    if (lock) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SF_CTRL_SF_ID_OFFSET_LOCK);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SF_CTRL_SF_ID_OFFSET_LOCK);
    }

    BL_WR_REG(SF_CTRL_BASE, SF_CTRL_2, tmpVal);
}
#endif

/****************************************************************************/ /**
 * @brief  SF controller send one command
 *
 * @param  cfg: Serial flash controller command configuration pointer
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SF_Ctrl_SendCmd(SF_Ctrl_Cmd_Cfg_Type *cfg)
{
    uint32_t tmpVal = 0;
    uint32_t timeOut = 0;
    uint32_t cmdOffset = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_SF_CTRL_CMD_MODE_TYPE(cfg->cmdMode));
    CHECK_PARAM(IS_SF_CTRL_ADDR_MODE_TYPE(cfg->addrMode));
    CHECK_PARAM(IS_SF_CTRL_DMY_MODE_TYPE(cfg->dummyMode));
    CHECK_PARAM(IS_SF_CTRL_DATA_MODE_TYPE(cfg->dataMode));

    timeOut = SF_CTRL_BUSY_STATE_TIMEOUT;

    while (SET == SF_Ctrl_GetBusyState()) {
        timeOut--;

        if (timeOut == 0) {
            return;
        }
    }

    if (SF_Ctrl_Is_Sbus2_Enable() == RESET) {
        tmpVal = BL_RD_REG(SF_CTRL_BASE, SF_CTRL_1);

        if (BL_GET_REG_BITS_VAL(tmpVal, SF_CTRL_SF_IF_FN_SEL) != SF_CTRL_OWNER_SAHB) {
            return;
        }

        cmdOffset = SF_CTRL_BASE + SF_CTRL_IF1_SAHB_OFFSET;
    } else {
        cmdOffset = SF_CTRL_BASE + SF_CTRL_IF2_SAHB_OFFSET;
    }

    /* Clear trigger */
    tmpVal = BL_RD_REG(cmdOffset, SF_CTRL_IF_SAHB_0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, SF_CTRL_IF_0_TRIG);
    BL_WR_REG(cmdOffset, SF_CTRL_IF_SAHB_0, tmpVal);

    /* Copy command buffer */
    BL_WR_REG(cmdOffset, SF_CTRL_IF_SAHB_1, cfg->cmdBuf[0]);
    BL_WR_REG(cmdOffset, SF_CTRL_IF_SAHB_2, cfg->cmdBuf[1]);

    tmpVal = BL_RD_REG(cmdOffset, SF_CTRL_IF_SAHB_0);

    /* Configure SPI and IO mode*/
    if (SF_CTRL_CMD_1_LINE == cfg->cmdMode) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_QPI_MODE_EN, SF_CTRL_SPI_MODE);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_QPI_MODE_EN, SF_CTRL_QPI_MODE);
    }

    if (SF_CTRL_ADDR_1_LINE == cfg->addrMode) {
        if (SF_CTRL_DATA_1_LINE == cfg->dataMode) {
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_SPI_MODE, SF_CTRL_NIO_MODE);
        } else if (SF_CTRL_DATA_2_LINES == cfg->dataMode) {
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_SPI_MODE, SF_CTRL_DO_MODE);
        } else if (SF_CTRL_DATA_4_LINES == cfg->dataMode) {
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_SPI_MODE, SF_CTRL_QO_MODE);
        }
    } else if (SF_CTRL_ADDR_2_LINES == cfg->addrMode) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_SPI_MODE, SF_CTRL_DIO_MODE);
    } else if (SF_CTRL_ADDR_4_LINES == cfg->addrMode) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_SPI_MODE, SF_CTRL_QIO_MODE);
    }

    /* Configure cmd */
    tmpVal = BL_SET_REG_BIT(tmpVal, SF_CTRL_IF_0_CMD_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_CMD_BYTE, 0);

    /* Configure address */
    if (cfg->addrSize != 0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, SF_CTRL_IF_0_ADR_EN);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_ADR_BYTE, cfg->addrSize - 1);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, SF_CTRL_IF_0_ADR_EN);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SF_CTRL_IF_0_ADR_BYTE, 0);
    }

